In [ ]:
# !pip install seaborn

In [1]:
import pandas as pd
import seaborn

#### subset
- head(n) / tail(n) / sample() / nlargest() / nsmallest()
- iloc[], loc[]

In [2]:
sample_df = pd.read_excel("./data/sample.xlsx")
sample_df.head()

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
0  KI1316  경기수원대리점  이기정  1720000  2952000     1     123
1  KI1451  충청홍성대리점  정미진  4080000  2706000     2     220
2  KI1534  경기화성대리점  경인선   600000  2214000     1     320
3  KI1636  강원속초대리점  이동권  3720000  2870000     3     110
4  KI1735  경기안양대리점  강준석  4800000  2296000     1     134

In [ ]:
sample_df.sample(frac=0.3)  # frac(tion) : 전체 데이터 개수 중 0.3의 비율로 랜덤추출

   Sap Co.        대리점 영업사원       전월       금월  TEAM  총 판매수량
15  KI2870   경기구리시대리점  박진형  6000000  3400000     2     143
13  KI2671  제주서귀포시대리점  주은명  4040000  4760000     4      50
7   KI2032    경기평택대리점  고유정  2736000  2139000     2      90
8   KI2153   경기의정부대리점  김은향  1368000  2484000     1     183
2   KI1534    경기화성대리점  경인선   600000  2214000     1     320
10  KI2313  제주서귀포시대리점  온지수   152000   945000     1      52

In [4]:
sample_df.nlargest(n=2, columns="전월")

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
14  KI2776  경기남양주대리점  김수진  8160000  4352000     2     354
15  KI2870  경기구리시대리점  박진형  6000000  3400000     2     143

In [5]:
sample_df.nsmallest(n=2, columns="전월")

   Sap Co.        대리점 영업사원      전월       금월  TEAM  총 판매수량
10  KI2313  제주서귀포시대리점  온지수  152000   945000     1      52
2   KI1534    경기화성대리점  경인선  600000  2214000     1     320

In [10]:
# 대리점, 영업사원, 전월, 금월
# sample_df[["대리점", "영업사원", "전월", "금월"]]
sample_df.iloc[:, 1:5]
sample_df.loc[:, "대리점":"금월"]

          대리점 영업사원       전월       금월
0     경기수원대리점  이기정  1720000  2952000
1     충청홍성대리점  정미진  4080000  2706000
2     경기화성대리점  경인선   600000  2214000
3     강원속초대리점  이동권  3720000  2870000
4     경기안양대리점  강준석  4800000  2296000
5    제주제주시대리점  민경수  3420000  2346000
6     경기광주대리점  김진혜  1292000  1518000
7     경기평택대리점  고유정  2736000  2139000
8    경기의정부대리점  김은향  1368000  2484000
9     경기성남대리점  이준수  1976000  1518000
10  제주서귀포시대리점  온지수   152000   945000
11    경기계양대리점  이희영  1833000  1404000
12    경기평촌대리점  강백호  4320000  2312000
13  제주서귀포시대리점  주은명  4040000  4760000
14   경기남양주대리점  김수진  8160000  4352000
15   경기구리시대리점  박진형  6000000  3400000
16    강원춘천대리점  김은향  4800000  4896000
17    강원영동대리점  전수창  4560000  3128000
18    경기하남대리점  김민정  2750000  7268000
19    강원포천대리점  서가은  2420000  4740000

In [17]:
list1 = list('abcde')
list1

['a', 'b', 'c', 'd', 'e']

In [25]:
# 중복 데이터 제거 후 추출
df = pd.DataFrame(
    {"a": [7, 5, 3, 3], "b": [6, 7, 3, 3], "c": [1, 3, 7, 7]},
    index=list("abcd"),
)
df

   a  b  c
a  7  6  1
b  5  7  3
c  3  3  7
d  3  3  7

In [21]:
df.drop_duplicates()

   a  b  c
a  7  6  1
b  5  7  3
c  3  3  7

In [22]:
df

   a  b  c
a  7  6  1
b  5  7  3
c  3  3  7
d  3  3  7

In [23]:
df.drop_duplicates(inplace=True)

In [26]:
df

   a  b  c
a  7  6  1
b  5  7  3
c  3  3  7
d  3  3  7

In [27]:
df.drop_duplicates("a")

   a  b  c
a  7  6  1
b  5  7  3
c  3  3  7

In [30]:
iris_df = seaborn.load_dataset("iris")
iris_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [31]:
# 전체 행, 열 수
iris_df.shape

(150, 5)

In [32]:
# species 종류별 데이터 개수
iris_df['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [ ]:
iris_df["species"].unique()  # 특정 열의 데이터 값 추출(중복 제거)

<StringArray>
['setosa', 'versicolor', 'virginica']
Length: 3, dtype: str

In [34]:
# 기술 요약 통계
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [35]:
iris_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    str
dtypes: float64(4), str(1)
memory usage: 6.0 KB

In [ ]:
iris_df.sum() # 합계

sepal_length                                                876.5
sepal_width                                                 458.6
petal_length                                                563.7
petal_width                                                 179.9
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

In [ ]:
iris_df.mean(numeric_only=True) # 평균

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [ ]:
iris_df.median(numeric_only=True) # 중앙값

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [ ]:
iris_df.quantile(numeric_only=True, q=[0.25, 0.75])  # ?% 값(default = 50%)

      sepal_length  sepal_width  petal_length  petal_width
0.25           5.1          2.8           1.6          0.3
0.75           6.4          3.3           5.1          1.8

In [3]:
# null 판별
df = pd.DataFrame(
    {"a": [7, 5, 3, 3], "b": [6, 7, 3, 3], "c": [1, 3, 7, 7]},
    index=list("abcd"),
)
df

   a  b  c
a  7  6  1
b  5  7  3
c  3  3  7
d  3  3  7

In [41]:
# b 값이 7이 아닌 행 찾기
df[df.b != 7]

   a  b  c
a  7  6  1
c  3  3  7
d  3  3  7

In [6]:
# b값이 7이 아닌 행 / a,b 컬럼만 조회
df.loc[df.b != 7, "a":"b"]

   a  b
a  7  6
c  3  3
d  3  3

In [5]:
# a 컬럼에 7이 있는지 확인
df[df.a.isin([7])]

   a  b  c
a  7  6  1

In [ ]:
# df.isna()
# df.isnull()

# a 컬럼이 null인지
df.a.isnull()

a    False
b    False
c    False
d    False
Name: a, dtype: bool

In [11]:
df = pd.DataFrame(
    {"a": [4, 5, 6, 6, pd.NA], "b": [7, 8, pd.NA, 9, 9], "c": [10, 11, 12, pd.NaT, 12]},
    index=[1, 2, 3, 4, 5],
)
df

      a     b    c
1     4     7   10
2     5     8   11
3     6  <NA>   12
4     6     9  NaT
5  <NA>     9   12

In [12]:
df.isna()

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [15]:
df.a.isna()
df.isna().sum()

a    1
b    1
c    1
dtype: int64

In [17]:
df.notna()
df.notnull()

       a      b      c
1   True   True   True
2   True   True   True
3   True  False   True
4   True   True  False
5  False   True   True

In [ ]:
df.dropna()  # null이 있는 행 삭제

   a  b   c
1  4  7  10
2  5  8  11

In [19]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4, 5]

In [20]:
# null일 경우 특정 값으로 채우기
df.fillna(0)

   a  b   c
1  4  7  10
2  5  8  11
3  6  0  12
4  6  9   0
5  0  9  12

In [39]:
df = seaborn.load_dataset("mpg")
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [40]:
# group by 하기
df.groupby(by="origin").count()
df.groupby(by="origin").size()
df.groupby(by="origin")["weight"].mean()
df.groupby(by=["origin", "cylinders"])["weight"].mean()
df.groupby(by="origin")["horsepower"].agg(["sum", "mean", "std"])

            sum        mean        std
origin
europe   5478.0   80.558824  20.157871
japan    6307.0   79.835443  17.819199
usa     29167.0  119.048980  39.897790

In [31]:
student_list = {
    "name": [
        "John",
        "Nate",
        "Abraham",
        "Brian",
        "Janny",
        "Yuna",
        "Jeniffer",
        "Edward",
        "Zara",
        "Wendy",
        "Sera",
    ],
    "major": [
        "Computer Science",
        "Computer Science",
        "Physics",
        "Psychology",
        "Economics",
        "Economics",
        "Computer Science",
        "Psychology",
        "Physics",
        "Physics",
        "Economics",
    ],
    "gender": [
        "male",
        "male",
        "male",
        "male",
        "female",
        "female",
        "female",
        "male",
        "male",
        "female",
        "female",
    ],
}
df = pd.DataFrame(student_list)
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward        Psychology    male
8       Zara           Physics    male
9      Wendy           Physics  female
10      Sera         Economics  female

In [35]:
df.groupby(by="major")["name"].count()

major
Computer Science    3
Economics           3
Physics             3
Psychology          2
Name: name, dtype: int64

In [36]:
df.groupby("gender")["name"].count()

gender
female    5
male      6
Name: name, dtype: int64

In [ ]:
# df.groupby(by="gender")["name"].agg(["sum", "mean", "std"]) # agg 여러개 구할때

#### apply()

In [41]:
df = pd.DataFrame({"yyyy-MM-dd": ["2005-09-28", "2010-10-05", "2017-12-20"]})
df

   yyyy-MM-dd
0  2005-09-28
1  2010-10-05
2  2017-12-20

In [46]:
def extract_year(value):
    return value.split("-")[0]

In [47]:
# year 컬럼 생성
df.dtypes

df["year"] = df["yyyy-MM-dd"].apply(extract_year)
df

   yyyy-MM-dd  year
0  2005-09-28  2005
1  2010-10-05  2010
2  2017-12-20  2017

In [50]:
# age 컬럼 생성
def get_age(year, curr_year):
    return curr_year - int(year)

In [51]:
df["age"] = df["year"].apply(get_age, curr_year=2026)
df

   yyyy-MM-dd  year  age
0  2005-09-28  2005   21
1  2010-10-05  2010   16
2  2017-12-20  2017    9

In [52]:
df = pd.DataFrame({"영어": [70, 80], "수학": [70, 100]}, index=["정이안", "최지우"])
df

     영어   수학
정이안  70   70
최지우  80  100

In [61]:
def func1(df):
    # print(df.index)
    # print(df.values)
    df["영어"] = 90
    return df

In [62]:
df2 = df.apply(func1,axis=1)
df2

     영어   수학
정이안  90   70
최지우  90  100